__tests__/stress.quick.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 20
      arrivalRate: 10
      rampTo: 50
      name: "Quick ramp"
    - duration: 20
      arrivalRate: 50
      name: "Peak"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Quick health check"
    weight: 50
    flow:
      - get:
          url: "/api/health"
      - get:
          url: "/api/products"

  - name: "Quick auth"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@cafeazzura.com"
            password: "admin123"
          capture:
            - json: "$.token"
              as: "token"
      - get:
          url: "/api/dashboard/stats"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "Quick booking"
    weight: 20
    flow:
      - post:
          url: "/api/bookings"
          json:
            name: "Quick Stress"
            email: "quick{{ $randomNumber(1,9999) }}@test.com"
            phone: "+6281234567"
            booking_date: "2026-12-20"
            booking_time: "20:00"
            guests: 3